[LegionChassis X2SparkArmorTemplate_DLC_3]
FriendlyName="Legion Chassis"
FriendlyNamePlural="Legion Chassis"
BriefSummary="A heavy SPARK chassis which provides great protection and survivability, but at the cost of regular chassis' mobility. This chassis grants the SPARK unit new combat abilities, allow it to support our squads with heavy firepower."
TacticalText="<Bullet/> Legion chassis provides great protection and survivability.\n<Bullet/> Two versions of powershot can devastate a large area and are benefited as heavy weapon.\n<Bullet/> Gun Shield allows the SPARK to negate incoming damage and counterfire."

[LegionChassisMk2 X2SparkArmorTemplate_DLC_3]
FriendlyName="Legion Chassis Mk.II"
FriendlyNamePlural="Legion Chassis Mk.II"
BriefSummary="A heavy SPARK chassis which provides great protection and survivability, but at the cost of regular chassis' mobility. This chassis grants the SPARK unit new combat abilities, allow it to support our squads with heavy firepower."
TacticalText="<Bullet/> New Legion chassis provides increased protection and survivability compared to its predecessor.\n<Bullet/> Gun Shield can now absorb more damage before breaking.\n<Bullet/> New Smart Core grants additional free shots."

[TitanCore X2SparkArmorTemplate_DLC_3]
FriendlyName="Energy Core"
FriendlyNamePlural="Energy Core"
BriefSummary="Energy Core is required for the Titan chassis to activate its core ability."
